Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཁམས་ལ་བདག་གིར་བྱ་བ་ཡོངས་སུ་སྤངས་པ་རྣམས་སྨིག་རྒྱུ་བར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned the idea of possession with respect to the elements with practices that focus on the metaphor of a mirage.

source: སྐྱེ་མཆེད་ཡོངས་སུ་སྤངས་པ་རྣམས་ལྦུ་བའི་ཕུང་པོར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned the sense fields with practices that focus on the metaphor of a clump of foaming bubbles.

source: འདོད་པའི་ཁམས་ཡོངས་སུ་སྤངས་པ་རྣམས་ཆུ་ཤིང་གི་སྙིང་པོ་མེད་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned the desire realm with practices that focus on the metaphor of the hollowness of plantain trees.

source: གཟུགས་ཀྱི་ཁམས་ཡོངས་སུ་སྤངས་པ་རྣམས་འདུ་བྱེད་མི་རྟག་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned the form realm with practices that focus on the impermanence of compounded phenomena.

source: གཟུགས་མེད་པའི་ཁམས་ཡོངས་སུ་སྤངས་པ་རྣམས་འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned the formless realm with practices that focus on the suffering associated with all compounded phenomena.

source: བསམ་གཏན་ལ་དགའ་བ་དང་བདེ་བ་ཡོངས་སུ་སྤངས་པ་རྣམས་ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned the joy and bliss of concentration with practices that focus on the fact that all phenomena lack a self.

source: འཁོར་བའི་སྡུག་བསྔལ་འདོད་པ་རྣམས་མྱ་ངན་ལས་འདའ་བ་ཞི་བར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who desire the suffering of saṃsāra with practices that focus on the peace of nirvāṇa.

source: གཞན་ཡང་ལམ་ངན་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་སྦྱོར་བས་ལྟ་བ་དེ་དག་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །
en: They will pacify the views of those who have completely abandoned unwholesome paths with practices that focus on the path of the ten virtuous actions.

source: ཡིད་དུ་འོང་བའི་སྐྱེ་བོ་ཡོངས་སུ་སྤངས་པ་རྣམས་མི་མཛེས་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned attractive beings with practices that focus on what is repulsive.

source: གཟུགས་ལ་ཆགས་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་རོ་སྔོན་པོར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned their attachment to the body with practices that focus on blue corpses.

source: སྒྲ་ལ་ཆགས་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་བྲག་ཅ་འབྱུང་བ་དང་ཟད་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned their attachment to sounds with practices that focus on the origination and destruction of echoes.

source: དྲི་ལ་ཆགས་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་རླུང་དུ་རྟོག་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned their attachment to smells with practices that focus on understanding the breath.

source: རོ་ལ་ཆགས་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་མི་མཛེས་པ་སྣ་ཚོགས་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned their attachment to tastes with practices that focus on various unpleasant tastes.

source: རེག་པ་ལ་ཆགས་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་མི་གཙང་བའི་ཡན་ལག་སུམ་ཅུ་རྩ་དྲུག་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have completely abandoned their attachment to tactile objects with practices that focus on the thirty-six impure substances.

source: སྙིང་རྗེ་མེད་པ་རྣམས་བྱམས་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who lack compassion with practices that focus on love.

source: གཏོང་བ་མེད་པ་རྣམས་སྦྱིན་པ་ཆེན་པོ་ལྔ་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who lack generosity with practices that focus on the five great forms of generosity.

source: གཏི་མུག་གིས་བསྒྲིབས་པ་རྣམས་ཁ་ཏོན་དུ་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who are obscured by ignorance with practices that focus on recitation.

source: འདུལ་བ་རྣམས་འཕགས་པའི་རིགས་ལ་དགའ་བར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who are disciplined with practices that focus on delighting the family of the noble ones.

source: སྡུག་བསྔལ་འདུལ་བ་རྣམས་རིམ་གྱིས་སེམས་རྩེ་གཅིག་ཏུ་འདུས་པར་རབ་ཏུ་སྦྱོར་བ་དང་།
en: They will pacify those who have tamed their suffering with practices that focus on gradually concentrating their minds one-pointedly.

source: འདུ་བྱེད་ཐམས་ཅད་ཀྱིས་མངོན་པར་སྤྲོས་པ་རྣམས་སྒྱུ་མ་ལྟ་བུར་རབ་ཏུ་སྦྱོར་བས་ཉོན་མོངས་པ་དེ་དག་ཞི་བར་འགྱུར་རོ།། །།བམ་པོ་ལྔ་པ།
en: And they will pacify those for whom mental formations lead to conceptual elaborations with practices that focus on the metaphor of being like an illusion.

source: གཞན་ཡང་སེམས་ཅན་ལྷ་དང་མིར་སྐྱེ་བར་བསམ་པ་རྣམས་ལ་དགེ་བ་བཅུའི་ལས་ཡོངས་སུ་དག་པར་སྦྱོར་བར་བྱེད་དོ། །
en: Those are the ways that they will pacify the afflictions of beings. “Furthermore, they will motivate those who want to be reborn as gods and humans to practice the ten pure virtuous actions.

source: ཉན་ཐོས་ཀྱི་ཐེག་པར་བསམ་པ་རྣམས་ལ་འཕགས་པའི་བདེན་པ་བཞི་དང་ལྡན་པར་ཡིད་ལ་བྱེད་པ་སྦྱོར་བར་བྱེད་དོ། །
en: They will motivate those who are intent upon the vehicle of the hearers to contemplate the four noble truths.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་བསམ་པ་རྣམས་ལ་རྟེན་ཅིང་འབྲེལ་པར་སྨྲ་བ་ཡིད་ལ་བྱེད་པ་སྦྱོར་བར་བྱེད་དོ། །
en: They will motivate those who are intent upon the vehicle of the solitary buddhas to contemplate the discourses on dependent arising.

source: སེམས་ཅན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྦྱོར་བར་བྱེད་དོ། །
en: They will motivate beings who follow the Great Vehicle to practice the six perfections.

source: ཐོག་མར་སེམས་བསྐྱེད་པ་རྣམས་ལ་ལྷག་པའི་བསམ་པ་ཕྱིར་མི་ལྡོག་པའི་སེམས་སྦྱོར་བར་བྱེད་དོ། །
en: They will motivate those who have given rise to the mind set on awakening for the first time to practice higher motivation and the intent to reach the level of nonregression.

source: སེམས་ཅན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྤྱོད་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་སྙིང་རྗེ་ཆེན་པོ་ལ་ཡོངས་སུ་མི་སྐྱོ་བས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྦྱོར་བར་བྱེད་དོ། །
en: They will motivate beings who are engaging in practicing the six perfections to never grow weary in their pursuit of great compassion and thus practice so that they can ripen beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་རྣམས་ལ་དེའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་ཚོགས་ཡོངས་སུ་དག་པར་སྦྱོར་བར་བྱེད་དོ། །
en: They will motivate the bodhisattvas who have reached the level of nonregression to adopt the practice of purifying the multitude of qualities of the buddha realms.

source: ཇི་ལྟ་བུར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གཞན་དུ་རྣམ་པར་སྤྱོད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་ཚོགས་ཡོངས་སུ་དག་པར་སྦྱོར་བར་བྱེད་པ་དེ་དག་དེའི་འོག་ཏུ་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེའོ། །
en: “As bodhisattvas travel to other pure buddha realms, they will display miracles using the supernormal faculties for those below who have adopted the practice of purifying the multitude of qualities of the buddha realms.

source: ཇི་ལྟ་བུར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གཞན་དུ་རྣམ་པར་སྤྱོད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཚོགས་མངོན་པར་འདོད་པ་དེ་དག་དེའི་འོག་ཏུ་མངོན་པར་ཤེས་པ་རྣམ་པར་རྩེ་བ་དེ་ལ་སྐྱེ་བར་འདོད་པ་ཇི་སྙེད་པ་དེར་སྐྱེའོ། །
en: As bodhisattvas travel to other pure buddha realms, all of the beings below who want to be among the multitude of their buddha field and wish to take birth in a place where there are such supernormal faculties and miraculous transformations will be reborn there.

source: ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པར་རྣམ་པར་མི་སྤྱོད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་ཚོགས་ཡོངས་སུ་དག་པ་འདོད་པ་ཡང་མེད་པ་དེར་སྐྱེ་བར་འདོད་པ་དེ་ཅི་ཙམ་པ་དེར་སྐྱེའོ། །
en: Even when they do not travel to afflicted buddha realms, the beings who want to be born there but have no desire to purify the multitude of qualities of a buddha realm will be born there.

source: ཡང་ཉོན་མོངས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་མི་འདོད་པ་དེ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བའི་བར་དུའོ། །
en: And those who do not want to be reborn in buddha realms that are inundated with afflictions will remain there until they become a fully manifest buddha who has attained unsurpassed, perfect, complete awakening.

source: རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་ལྟ་བ་དོག་པ་རྙེད་པ་དང་། མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། མི་དགེ་བའི་རྩ་བ་དང་ལྷན་ཅིག་ཏུ་འགྲོགས་པ་རྣམས་རྒྱུན་གཅོད་དོ། །
en: “In buddha realms inundated with the five impurities, bodhisattvas will put an end to beings who hold on to views and are filled with doubts, who commit the acts with immediate retribution, who reject the sacred Dharma, who denigrate the noble ones, and who involve themselves with the roots of nonvirtue.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སེམས་ཅན་བསམ་པ་ཡོངས་སུ་དག་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་གྲངས་མེད་པ་རྣམས་ལ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ་རྣམས་ལ་ཆོས་སྟོན་པར་བྱེད་དོ། །
en: They will perform the deeds of the buddhas for beings in pure buddha realms who have pure intentions, and they will teach the Dharma to bodhisattvas who are experts in the wisdom that comprehends the immeasurable and innumerable buddha qualities.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་རྣམ་པ་དེ་ལྟ་བུའི་རྩལ་བྱེད་ཀྱང་གང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་རྣམ་པ་དེ་ལྟ་བུའི་རྩལ་བྱེད་མི་ནུས་སོ། །
en: “In the pure buddha realms, bodhisattvas are unable to exert the same level of strength as the level of strength exerted by bodhisattvas in buddha realms inundated with the five impurities.

source: ཡང་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གཅིག་གི་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཅིག་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་ཐབས་རབ་ཏུ་སྦྱོར་བ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཅིག་གིས་འདོད་ཆགས་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་།
en: In this buddha realm inundated with the five impurities, if bodhisattvas recognize the 21,000 different expressions of desire in a single being, they will accordingly apply 21,000 different skillful means to pacify that being’s desires.

source: གལ་ཏེ་སེམས་ཅན་གཅིག་གི་ཞེ་སྡང་སྤྱོད་པ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཅིག་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་ཐབས་ལ་མཁས་པ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཅིག་གིས་ཞེ་སྡང་ཞི་བར་བྱེད་པ་དང་།
en: If they recognize the 21,000 different expressions of anger in a single being, they will accordingly apply 21,000 different skillful means to pacify that being’s anger.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གཅིག་གི་སྐལ་བ་དང་བཅས་པར་སྤྱོད་པ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཅིག་རབ་ཏུ་ཤེས་པ་དེ་བཞིན་དུ་ཐབས་ལ་མཁས་པ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཅིག་གིས་ཞི་བར་བྱེད་པ་དང་།
en: If bodhisattvas recognize the 21,000 different expressions of a single fortunate being, they will accordingly apply 21,000 different skillful means to pacify that being.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་སེམས་ཅན་གཅིག་གི་སྐལ་བ་དང་བཅས་པར་སྤྱོད་པ་ཉོན་མོངས་པ་ཀུན་ནས་ལྡང་བ་རབ་ཏུ་ཞི་བར་ནུས་པ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྩལ་ཆེན་པོ་བྱེད་དོ། །
en: That is how bodhisattvas who are able to pacify the continual arising of the afflicted behaviors of a single fortunate being exercise great strength.

source: གང་སེམས་ཅན་གཅིག་གི་ཉོན་མོངས་པའི་རྒྱུ་སྤྱོད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རབ་ཏུ་ཤེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་སེམས་ཅན་གཅིག་གི་དགོས་པས་བརྩོན་འགྲུས་བརྟན་པ་ལ་མོས་ཤིང་ཕ་རོལ་གནོན་པ་ན་ཐབས་ལ་མཁས་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རབ་ཏུ་སྦྱོར་བ་དང་།
en: When bodhisattvas who recognize the 84,000 different types of behavior that generate afflictions in a single being are brave and committed to steadfast effort, they apply the 84,000 skillful means.

source: ཕ་རོལ་གནོན་པས་གཟིར་བ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་རྩལ་ཆེན་པོ་འདི་ལ་ལྟོས་ཤིག །
en: Look at the great strength of those bodhisattvas and what they overcome with their bravery!

source: ཇི་ལྟར་སེམས་ཅན་གཅིག་གི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་ནུས་པ་དེ་ལྟར་གཉིས་དང་། གསུམ་དང་།
en: Just as they are able to pacify the afflictions of a single being, they can also pacify the 84,000 characteristics of the afflicted behavior of anywhere from two, three, or four beings up to all the beings living in an entire continent.

source: བཞི་ནས་གླིང་གཅིག་གི་སེམས་ཅན་ཡོངས་སུ་ཚང་བ་རེ་རེའི་དགོས་པས་ཉོན་མོངས་པ་སྤྱོད་པའི་མཚན་ཉིད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རབ་ཏུ་ཞི་བར་བྱེད་ཅིང་གླིང་གཉིས་པ་དང་གླིང་བཞི་པ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་དུ་སེམས་ཅན་ཐམས་ཅད་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བཟོད་པ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Similarly, they can liberate all the beings from all their afflictions living on two and even four continents, up to all the beings living in buddha realms in the ten directions as numerous as all the grains of sand in the Ganges. This is why it is said that bodhisattvas achieve acceptance in buddha realms inundated with the five impurities.

source: ཇི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རེ་རེའི་ཉོན་མོངས་པའི་དབང་པོ་སྤྱོད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིས་འཇུག་པ་དེ་ལྟར་སེམས་ཅན་གཅིག་གི་མོས་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རབ་ཏུ་ཤེས་ཤིང་བྲི་བའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། འཕེལ་བའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། གནས་པའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། རྟོགས་པའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། མི་རྟག་པའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་།
en: “They engage the afflicted faculties of each being with 84,000 types of conduct and also recognize the 84,000 different interests of a single being.

source: སྡུག་བསྔལ་གྱི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། བདག་མེད་པའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཅན་གྱི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། སྟོང་པའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། དབེན་པའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་ནས་དེ་བཞིན་དུ་མཚན་ཉིད་མེད་པའི་བར་དུ་རབ་ཏུ་ཤེས་པ་དང་།
en: They also know everything from the characteristics of decrease and increase, the characteristic of abiding, the characteristic of realization, the characteristic of impermanence, the characteristic of suffering, the characteristic of the absence of self, the characteristic of being, the characteristic of emptiness, and the characteristic of isolation, up to the absence of characteristics.

source: མྱ་ངན་ལས་འདའ་བའི་མཚན་ཉིད་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཅན་རེ་རེའི་ཆགས་པའི་མཚན་ཉིད་སྣ་ཚོགས་བརྒྱད་ཅུ་རྩ་བཞི་རབ་ཏུ་ཤེས་པས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་སྤྱོད་པའི་མཚན་ཉིད་མངོན་པར་ཤེས་པར་འགྱུར་རོ། །
en: They know the characteristic of nirvāṇa, and the 84,000 various characteristics of the attachment of every being. This is why the bodhisattvas actually know the characteristics of beings’ behavior.

source: བསམ་པའི་ཚུལ་ཤེས་པས་སེམས་ཅན་ཉོན་མོངས་པ་དམ་པོས་བཅིངས་པ་ལས་ཡོངས་སུ་ཐར་བར་ནུས་སོ། །
en: Since they know the way they think, they are able to liberate beings who are bound by the shackles of the afflictions.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་དང་། རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: This is how bodhisattvas ripen beings in buddha realms inundated with the afflictions and the five impurities.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་མི་དགེ་བའི་རྩ་བ་དང་།
en: They remain in those places to ripen them, continuously manifesting their great compassion for those who involve themselves with roots of nonvirtue.

source: ལྷན་ཅིག་ཏུ་འགྲོགས་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་རྒྱུན་མི་གཅོད་ཅིང་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདུག་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་རྩལ་ཆེན་པོའོ། །
en: This is the great strength of the bodhisattvas!”

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པས་འདི་བསྟན་པ་སྟོན་པ་ན། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་ལྷགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆུ་བོ་གང་གཱ་སུམ་ཅུའི་བྱེ་མ་སྙེད་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As the bodhisattva Uncovering the Enemies delivered this teaching, the bodhisattvas who had arrived from countless buddha realms in the ten directions and other bodhisattvas as numerous as all the grains of sand in thirty Ganges Rivers achieved the acceptance of the unborn nature of phenomena.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱིས་དགའ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་མགྲིན་གཅིག་ཏུ་འདི་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: Bodhisattvas as numerous as all the grains of sand in the Ganges achieved the absorption known as giving joy.

source: ཆུ་བོ་གང་རྣམས་བལྟ་དཀའ་ཆུ་བོས་ཁྱེར། །ང་རྒྱལ་མངོན་པའི་ང་རྒྱལ་ཡུལ་ལས་ཤེས། །
en: All of them prostrated to the Thus-Gone One Śākyamuni with their palms together and uttered the following verses in unison: “Pride and actions within the sphere of excessive pride Are known as being submerged in a river and carried off by a river.

source: ཉོན་མོངས་རྒྱ་མཚོ་ལས་ནི་མཐར་ཕྱིན་མེད། །ལམ་གྱིས་བདག་ཅག་ཀྱང་ནི་རྣམ་པར་གནས། །
en: Since there is no end to the ocean of afflictions, We will stay on the path.

source: སེམས་ཅན་གང་རྣམས་ཉོན་མོངས་གཏུམ་པས་གདུངས། །ཉོན་མོངས་སངས་རྒྱས་ཞིང་དུ་རྟག་རྣམ་མྱོས། །ངན་སོང་འགྲོ་བར་རྟག་ཏུ་སྡུག་བསྔལ་བསགས། །
en: “Beings in afflicted buddha realms are Tormented by severe afflictions, are always intoxicated, Are born in the lower realms, and incur perpetual suffering.

source: འཆད་མཁན་དམ་པའི་དོན་གྱི་ཐེག་པ་སྟོན། །
en: We teachers will teach them the vehicle of the ultimate truth!

source: བདག་ཅག་ཉོན་མོངས་སེམས་ཅན་རྣམས་དགོས་པས། །སངས་རྒྱས་ཞིང་དེར་སྨོན་ལམ་བྱེད་འགྱུར་བ། །
en: “We will aspire to be born in those buddha realms For the sake of those afflicted beings!

source: ཉོན་མོངས་ཞིང་དུ་བདག་ཅག་སྤྱད་པ་སྤྱོད། །སེམས་ཅན་ཉོན་མོངས་དམ་བཅིངས་གྲོལ་བར་བྱེད། །
en: We will practice the conduct in those afflicted realms That liberates beings who are bound by the shackles of the afflictions!

source: གང་དག་འདོད་ཆགས་ཞེ་སྡང་ང་རྒྱལ་དྲེགས། །གཏི་མུག་ལམ་སྟོར་སྡིག་པ་རབ་བྱེད་པ། །སྡིག་པ་ཐམས་ཅད་ལས་ནི་བདག་ཅག་ཟློག །འཁོར་བའི་དགོན་པ་འཇིགས་ལས་རབ་ཏུ་སྒྲོལ། །
en: “We will turn those who have lost the path and commit wicked deeds Out of attachment, anger, pride, conceit, and ignorance Away from all of those wicked deeds and Free them from the fear of the wasteland of saṃsāra.

source: གང་དམྱལ་བྱོལ་སོང་ཡི་དགས་འཇིག་རྟེན་དུ། །རྟག་ཏུ་འདོད་མེད་སྡུག་བསྔལ་མྱོང་བ་དག །བདག་ཅག་སྡུག་བསྔལ་ཐམས་ཅད་ལས་གྲོལ་བྱེད། །ཉོན་མོངས་སངས་རྒྱས་ཞིང་དུ་བྱང་ཆུབ་སྤྱོད། །
en: “We will free all those who constantly experience Unwanted suffering in the hell realms, the animal realm, And the preta realm from all manner of suffering, And practice the conduct of awakening in afflicted buddha realms!”

source: ཡང་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པར་ཁྱབ་པའི་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། སྐྱེས་བུ་དམ་པ་ལེགས་པར་སྤོབས་ཤིང་མཆོག་ཏུ་རྒྱ་ཆེ་བའི་བརྩོན་འགྲུས་བརྟན་པ་ལ་བརྩོན་པ་ཕ་རོལ་གནོན་པ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པའི་ཆོས་ཀྱི་སྒོ་བསྟན་པ་ལེགས་སོ་ལེགས་སོ། །
en: All of those present in that assembly that pervaded this entire buddha realm applauded, saying, “Good man, you are extremely eloquent and this teaching on courage and exerting oneself in steadfast, supreme, vast effort, a gateway to the Dharma that liberates beings, is excellent, excellent!

source: གང་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་སྐྱེས་བུ་དམ་པ་འདིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་བོར་ཏེ་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྤྱོད་པ་ལ་བརྩོན་ནོ། །སེམས་ཅན་མཚམས་མེད་པར་བྱེད་པ་དང་།
en: All these good men as numerous as all the grains of sand in the Ganges have left behind their practice of the conduct of awakening in the pure buddha realms and will now diligently practice that conduct in buddha realms that are inundated with the five impurities.

source: དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། ལུས་ཚིག་པ་དང་། མི་དགེ་བའི་རྩ་བ་དང་ལྷན་ཅིག་ཏུ་འགྲོགས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་དོ། །
en: They will generate great compassion to ripen beings who commit the five acts with immediate retribution, who reject the sacred Dharma, who denigrate the noble ones, whose bodies are burning, and who involve themselves with the roots of nonvirtue.

source: ཉོན་མོངས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྟོན་ཏོ། །
en: They will teach afflicted buddha realms about unsurpassed buddha realms.

source: ལུས་མེད་པ་ཕུང་པོ་སྤོང་བའི་མཐའ་སྟོན་ཏོ། །
en: They will teach the ultimate position of the body’s nonexistence and abandoning the aggregates.

source: ཚིག་ཙམ་གྱིས་སྐྱེས་བུ་དེ་དག་བརྩོན་པར་འགྱུར་བ་དེ་དག་ལ་གང་ལྷ་དང་འཇིག་རྟེན་དུ་བཅས་པས་མཆོད་པ་མཆོག་ཏུ་རྒྱ་ཆེན་པོ་བྱེད་ན་དེ་དག་གི་བརྟན་པའི་བརྩོན་འགྲུས་ཕ་རོལ་གནོན་པ་འདི་ལ་བརྩོན་པ་ལྟ་ཅི་སྨོས་ཏེ།
en: If the world with its gods makes vast and supreme offerings to beings who express their diligence with mere words, there is no need to mention those who possess steadfast effort and courage, and direct their efforts to these realms!

source: ཇི་ལྟར་ཚིག་གིས་དམ་བཅས་པ་དེ་ལྟར་དགོས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: All their goals will be fulfilled just as promised.”

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ་སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ། །
en: At that point, the Thus-Gone One Śākyamuni gave his approval, saying, “Excellent, my good man, excellent!

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་སྨྲ་བའི་ཚིག་ཙམ་གྱིས་རྩོམ་པར་འགྱུར་བ་དེ་དེ་བཞིན་ཏེ། དེ་དག་ལ་གང་ལྷ་དང་འཇིག་རྟེན་དུ་བཅས་པས་མཆོད་པ་མཆོག་ཏུ་རྒྱ་ཆེན་པོ་བྱེད་ན་དེའི་ཤེས་པས་ཉོན་མོངས་པ་དང་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་རྣམ་པ་དེ་ལྟ་བུའི་དེ་དག་གི་རྩལ་ཆེན་པོ་བྱ་བར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: Noble son, if the world with its gods makes vast and supreme offerings to those who undertake such things using mere words, there is no need to mention the great strength they will exert through their wisdom in this buddha realm inundated with the afflictions and the five impurities!

source: མཚམས་མེད་པར་བྱེད་པ་ནས་མི་དགེ་བའི་རྩ་བ་དང་ལྷན་ཅིག་ཏུ་འགྲོགས་པའི་བར་དུ་རྣམ་པ་དེ་ལྟ་བུའི་བརྟན་པའི་བརྩོན་འགྲུས་ཕ་རོལ་གནོན་པའི་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །
en: They will ripen all beings from those who commit the acts with immediate retribution, up to those who involve themselves with the roots of nonvirtue, through the appropriate skillful means of steadfast effort and courage.”

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པས་དེ་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཤེས་རབ་ཀྱི་ཐབས་ལ་མཁས་པའི་ཆོས་ཀྱི་སྒོ་བསྟན་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཚིག་འདི་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ས་ཆེན་པོ་འདི་ལན་དྲུག་ཏུ་གཡོས་སོ། །
en: As soon as the bodhisattva Uncovering the Enemies had finished teaching the gateway to the Dharma of the skillful means of insight that ripens beings, and the Blessed One had said those words, the great earth of this trichiliocosm shook in six ways.

source: ལྷ་རྫས་ཀྱི་མེ་ཏོག་གི་ཆར་ཡང་རབ་ཏུ་ཕབ་བོ། །ལྷ་རྫས་ཀྱི་རོལ་མོ་ཡང་རབ་ཏུ་དཀྲོལ་ཏོ། །ལྷ་དང་། དྲི་ཟ་དང་། མིའི་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་པོ་དེ་དག་ལ་མཆོག་ཏུ་རྒྱ་ཆེ་བའི་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བརྩོན་ནོ། །
en: A rain of divine flowers fell from the sky, divine music resounded everywhere, and all the assemblies of gods, gandharvas, and humans began to worship the bodhisattva Uncovering the Enemies and those bodhisattvas as numerous as all the grains of sand in the Ganges with magnificent offerings, while reciting the following verses: “Please reveal the treasury of omniscient wisdom.

source: ཇི་སྙེད་ཡེ་ཤེས་མཛོད་འདི་བསྟན་དུ་གསོལ། །ཡེ་ཤེས་ཕྱིར་ཡང་སྟོན་པ་འདི་ཉིད་སྟོན། །
en: Please deliver this teaching for the sake of wisdom.

source: མཁྱེན་པ་ཁྱེད་ཀྱི་གང་གི་སློབ་སྟོན་པ། །
en: Wise one, teach us what you have learned.

source: ཐུབ་པ་ཤེས་པའི་སྨྲ་བ་འདི་ལ་འཇུག །
en: Sage, begin this insightful discourse.

source: མཁྱེན་པ་ཅན་གྱི་ཞིང་མང་བྱེ་བ་ལ། །ཐོབ་པའི་ཡེ་ཤེས་སྟོན་པ་འདི་ལ་འཇུག །
en: “Wise one, begin this teaching on the wisdom You attained in the many millions of realms.

source: བདག་ནི་ཡེ་ཤེས་འབྲོག་ས་མྱུར་གནས་ཤིང་། །ཚུལ་འདི་ལ་ཡང་ཡེ་ཤེས་ལམ་རབ་སྟོན། །
en: Please show us the path of wisdom that leads the way, So we may swiftly dwell in the meadows of wisdom.

source: ཇི་ལྟར་བྱང་ཆུབ་སྤྱོད་ཕྱིར་ཤེས་འགྱུར་བ། །རྒྱལ་བ་ཡེ་ཤེས་རྒྱལ་མཚན་འདི་ལ་འཇུག །
en: “Victor, please raise the banner of wisdom So we may understand the conduct of awakening.

source: ཇི་ལྟར་ནམ་མཁའ་དྲི་མེད་སྟོང་པའི་ཆོས། །བདག་དང་འཐུན་པའི་གཏམ་དག་བསྟན་དུ་གསོལ། །
en: Please give a teaching that is appropriate for us On space-like, stainless, empty phenomena.

source: སྟོན་མཁན་མི་ཡི་གཙོ་བོ་འདི་ལ་མཆོག །མཆོག་ཏུ་ཡིད་དུ་འོང་ཞིང་མཛེས་པ་སྟོན། །སྟོང་པ་ཉིད་ཀྱིས་ཉོན་མོངས་དགྲ་ཟིལ་གནོན། །རྟག་པ་དང་ནི་ཆད་པ་ཐལ་བར་བྱས། །
en: “Teacher, supreme among the highest human beings, You display utter beauty and splendor, You overpower the enemy of the afflictions with emptiness, And you pulverize the views of permanence and annihilation.
